## Recommendation Example: Small dataset

#### Importing Library

In [1]:
import pandas as pd

#### Loading the dataset

In [ ]:
# # uploading in colab
# from google.colab import files
# uploaded = file.upload()

In [5]:
# Reading the dataset
ratings = pd.read_excel('example_data.xlsx', index_col=0)

In [6]:
# top few rows
ratings.head()

        TopGun  Terminator  Dune  LittleWomen  ForestGump  Titanic
Jack       5.0         4.0   4.0          NaN         1.0      1.0
Joan       4.0         3.0   5.0          2.0         2.0      NaN
Sarah      1.0         NaN   NaN          4.0         3.0      5.0
Alex       NaN         2.0   1.0          4.0         NaN      5.0
Hannah     1.0         NaN   2.0          3.0         3.0      4.0

### Item Based Collaborative Filtering

In [7]:
# correlation matrix
corrMatrix = ratings.corr()
corrMatrix.head(6)

               TopGun  Terminator      Dune  LittleWomen  ForestGump   Titanic
TopGun       1.000000    1.000000  0.838628    -0.866025   -0.971061 -0.970725
Terminator   1.000000    1.000000  0.720577    -1.000000   -1.000000 -1.000000
Dune         0.838628    0.720577  1.000000    -0.960769   -0.654654 -0.995871
LittleWomen -0.866025   -1.000000 -0.960769     1.000000    0.866025  1.000000
ForestGump  -0.971061   -1.000000 -0.654654     0.866025    1.000000  0.970725
Titanic     -0.970725   -1.000000 -0.995871     1.000000    0.970725  1.000000

In [8]:
# find similar item 
corrMatrix['Titanic'].sort_values(ascending = False)

LittleWomen    1.000000
Titanic        1.000000
ForestGump     0.970725
TopGun        -0.970725
Dune          -0.995871
Terminator    -1.000000
Name: Titanic, dtype: float64

### User Based Collaborative Filtering

In [9]:
# transposing dataframe
ratings.T

             Jack  Joan  Sarah  Alex  Hannah
TopGun        5.0   4.0    1.0   NaN     1.0
Terminator    4.0   3.0    NaN   2.0     NaN
Dune          4.0   5.0    NaN   1.0     2.0
LittleWomen   NaN   2.0    4.0   4.0     3.0
ForestGump    1.0   2.0    3.0   NaN     3.0
Titanic       1.0   NaN    5.0   5.0     4.0

In [10]:
# correlation matrix
corrMatrix = ratings.T.corr()
corrMatrix.head()

            Jack      Joan     Sarah      Alex    Hannah
Jack    1.000000  0.745356 -0.866025 -0.970725 -0.939336
Joan    0.745356  1.000000 -0.944911 -0.928571 -0.754337
Sarah  -0.866025 -0.944911  1.000000  1.000000  0.969458
Alex   -0.970725 -0.928571  1.000000  1.000000  0.960769
Hannah -0.939336 -0.754337  0.969458  0.960769  1.000000

In [11]:
# Find similar user
corrMatrix['Sarah'].sort_values(ascending = False)

Sarah     1.000000
Alex      1.000000
Hannah    0.969458
Jack     -0.866025
Joan     -0.944911
Name: Sarah, dtype: float64